Autodesk.Revit.DB.ListType
An enumerated type indicating the style of list item
for paragraphs that are part of ordered or unordered lists
in FormattedText.
Since:
2017

Autodesk.Revit.DB.ListType.UpperCaseLetters
The paragraph is a part of an ordered list with upper-case letter headings.

Autodesk.Revit.DB.ListType.LowerCaseLetters
The paragraph is a part of an ordered list with lower-case letter headings.

Autodesk.Revit.DB.ListType.ArabicNumbers
The paragraph is a part of an ordered list with Arabic number headings.

Autodesk.Revit.DB.ListType.Bullet
The paragraph is a part of a bulleted list.

Autodesk.Revit.DB.ListType.None
The paragraph is not a part of a list.

Autodesk.Revit.DB.ListType.Mixed
This value may be returned by FormattedText.GetListType()
when there are multiple list types in the selected range.